Documents/ESB/ESB_Consumer_0525/003TestSample/SAMPLE_XML_MUST/RewardPoints/RP08_RwdPntsRedVrfyRq.xml

<?xml version="1.0" encoding="utf-8"?>

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:v1="http://www.iisigroup.com/magiclamp/common/soapenv.xsd/v1" xmlns:v11="http://www.nextbank.com.tw/xsd/TW/RewardPoints/RwdPntsRedVrfyRq/v1">  
  <soap:Header> 
    <v1:Header v1:mustUnderstand="true"> 
      <ChannelID>ESB</ChannelID>  
      <ServiceDomain>RewardPoints</ServiceDomain>  
      <OperationName>RwdPntsRedVrfy</OperationName>  
      <ConsumerID>TWESB</ConsumerID>  
      <TransactionID>T1222222</TransactionID>  
      <RqTimestamp>2015-12-06T12:01:01.00+08:00</RqTimestamp> 
    </v1:Header> 
  </soap:Header>  
  <soap:Body> 
    <v11:RwdPntsRedVrfyRq> 
      <v11:ServiceHeader> 
        <v11:TxnId>RP08</v11:TxnId>  
        <v11:TxnNo>RP0800001</v11:TxnNo> 
      </v11:ServiceHeader>  
      <v11:Signon> 
        <v11:CustId>ESBUSER</v11:CustId> 
      </v11:Signon>  
      <v11:ServiceBody> 
        <v11:MmbId>A123456789</v11:MmbId>  
        <v11:MrchId>29887923</v11:MrchId>  
        <v11:OrdNo>29887923001122334455</v11:OrdNo>  
        <v11:OrdType>1</v11:OrdType>  
        <v11:PntsRed>3000</v11:PntsRed>  
        <v11:StlDate>20191207</v11:StlDate> 
      </v11:ServiceBody> 
    </v11:RwdPntsRedVrfyRq> 
  </soap:Body> 
</soap:Envelope>
